Note/MIT6.828.lab1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-06-29 Mon 23:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MIT6.828 Lab 1</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Comcx" />
<link rel="stylesheet" type="text/css" href="org-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="org-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="icon" type="image/x-icon" href="../images/digimon-icon.png" />
</head>
<body>
<div id="content">
<h1 class="title">MIT6.828 Lab 1</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1f197f5">1. Software and Environment Setup</a>
<ul>
<li><a href="#orgff16fc1">1.1. Pull ubuntu from docker-hub and make a dockerfile</a></li>
<li><a href="#org85d09ba">1.2. Install patched QEMU</a>
<ul>
<li><a href="#orge16fcd8">1.2.1. Pitfalls</a></li>
</ul>
</li>
<li><a href="#orgb0ef2f0">1.3. Pull JOS repository</a></li>
</ul>
</li>
<li><a href="#orgd4f8613">2. Part 1: PC Bootstrap</a>
<ul>
<li><a href="#org3789845">2.1. Exercise 1</a></li>
<li><a href="#orgfcca574">2.2. The PC's Physical Address Space</a></li>
<li><a href="#org6932729">2.3. Exercise 2</a></li>
</ul>
</li>
<li><a href="#orgd10fd1d">3. Part 2: The Boot Loader</a>
<ul>
<li><a href="#orgc58b143">3.1. Exercise 3</a>
<ul>
<li><a href="#orgf403c01">3.1.1. GDB useful instructions</a></li>
<li><a href="#org8d24aba">3.1.2. Trace 0x7C00</a></li>
<li><a href="#org21d3002">3.1.3. Trace bootmain and readect</a></li>
<li><a href="#org86c021d">3.1.4. Questions</a></li>
</ul>
</li>
<li><a href="#org2e74333">3.2. Loading the kernel</a>
<ul>
<li><a href="#orgeae11c7">3.2.1. Exercise 5</a></li>
<li><a href="#org01bcaa2">3.2.2. ELF format</a></li>
<li><a href="#org9bfdf99">3.2.3. Exercise 5</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org58bac30">4. Part 3: The Kernel</a>
<ul>
<li><a href="#org59edb95">4.1. Exercise 7</a></li>
<li><a href="#org3493dce">4.2. Formatted Printing to the Console</a>
<ul>
<li><a href="#org1365bea">4.2.1. Exercise 8</a></li>
<li><a href="#orgb274763">4.2.2. Explain the following code from <code>kern/console.c</code> .</a></li>
</ul>
</li>
<li><a href="#orgc1cc327">4.3. The Stack</a>
<ul>
<li><a href="#org5742cc4">4.3.1. Exercise 9</a></li>
<li><a href="#org65d6d34">4.3.2. Exercise 10</a></li>
<li><a href="#org6d6e509">4.3.3. Exercise 11</a></li>
<li><a href="#org7f53a61">4.3.4. Exercise 12</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4e9f341">5. Epilogue</a></li>
</ul>
</div>
</div>
<p>
I want to review MIT6.828 labs and homework&#x2026;
This is still essential for me to make a better pl someday :)
</p>

<ul class="org-ul">
<li>Reference</li>
</ul>
<p>
<a href="https://pdos.csail.mit.edu/6.828/2018/labs/lab1/">MIT6.828 2018 Lab 1</a>
</p>

<div id="outline-container-org1f197f5" class="outline-2">
<h2 id="org1f197f5"><span class="section-number-2">1</span> Software and Environment Setup</h2>
<div class="outline-text-2" id="text-1">
<p>
The origin course uses <span class="underline">athena</span> and a patched <span class="underline">qemu</span> .
I do not want to install a new virtual OS or have a new computer or
ruin my current computer.
Therefore, I decide to use <span class="underline">docker</span> and make a virtual environment which is
effcient and light-weight.
</p>

<p>
The process is a little tough though&#x2026;
</p>
</div>

<div id="outline-container-orgff16fc1" class="outline-3">
<h3 id="orgff16fc1"><span class="section-number-3">1.1</span> Pull ubuntu from docker-hub and make a dockerfile</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-shell">$ docker pull ubuntu:18.04
</pre>
</div>

<ul class="org-ul">
<li>Dockerfile</li>
</ul>
<pre class="example">
FROM ubuntu:18.04

RUN apt-get update \
    &amp;&amp; apt-get install -y \
    sudo \
    git \
    g++ \
    emacs \
    make \
    gcc-multilib \
    &amp;&amp; useradd --create-home --no-log-init --shell /bin/bash comcx \
    &amp;&amp; adduser comcx sudo \
    &amp;&amp; echo 'comcx:mimawei0' | chpasswd

USER comcx
WORKDIR /home/comcx

</pre>

<ul class="org-ul">
<li>Build</li>
</ul>
<pre class="example">
$ docker build -t oslab .
</pre>
<p>
Now we have a very small environment prototype which will be fixed into our experiment space later:)
</p>

<p>
Run the following command into the container!
</p>
<pre class="example">
$ docker run -it oslab bash
</pre>
</div>
</div>

<div id="outline-container-org85d09ba" class="outline-3">
<h3 id="org85d09ba"><span class="section-number-3">1.2</span> Install patched QEMU</h3>
<div class="outline-text-3" id="text-1-2">
<p>
We need to firstly pull the patched qemu following reference page.
<a href="https://pdos.csail.mit.edu/6.828/2018/tools.html">Tool page</a>
</p>
<div class="org-src-container">
<pre class="src src-shell">$ git clone https://github.com/mit-pdos/6.828-qemu.git qemu
$ cd qemu
$ ./configure --disable-kvm --disable-werror --disable-sdl <span style="color: #ffd700;">[</span>--prefix=PFX<span style="color: #ffd700;">]</span> <span style="color: #ffd700;">[</span>--target-list=<span style="color: #ad7fa8; font-style: italic;">"i386-softmmu x86_64-softmmu"</span><span style="color: #ffd700;">]</span>
$ make &amp;&amp; make install
</pre>
</div>
</div>

<div id="outline-container-orge16fcd8" class="outline-4">
<h4 id="orge16fcd8"><span class="section-number-4">1.2.1</span> Pitfalls</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>Executing "./configure &#x2013;disable-kvm &#x2026;" 
<ul class="org-ul">
<li>ERROR: Python not found. Use &#x2013;python=/path/to/python</li>
<li>To fix: install python2.7, and add &#x2013;python=python2.7</li>

<li>ERROR: pkg-config binary 'pkg-config' not found</li>
<li>apt-get install -y pkg-config</li>

<li>ERROR: zlib check failed. Make sure to have the zlib libs and headers installed.</li>
<li>sudo apt-get install zlib1g-dev</li>

<li>ERROR: glib-2.12 gthread-2.0 is required to compile QEMU</li>
<li>sudo apt-get install libglib2.0-dev</li>
</ul></li>
</ul>

<p>
Finally, we are done.
</p>
</div>
</div>
</div>

<div id="outline-container-orgb0ef2f0" class="outline-3">
<h3 id="orgb0ef2f0"><span class="section-number-3">1.3</span> Pull JOS repository</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-shell">$ git clone https://pdos.csail.mit.edu/6.828/2018/jos.git lab
</pre>
</div>

<p>
Inside lab/, try <code>make qemu</code> ,if the program runs, then our basic experiment space is now ready.
</p>
<pre class="example">
$ docker commit &lt;container&gt; mit6.828
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd4f8613" class="outline-2">
<h2 id="orgd4f8613"><span class="section-number-2">2</span> Part 1: PC Bootstrap</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3789845" class="outline-3">
<h3 id="org3789845"><span class="section-number-3">2.1</span> Exercise 1</h3>
<div class="outline-text-3" id="text-2-1">
<blockquote>
<p>
Familiarize yourself with the assembly language materials available on the 6.828 reference page. 
You don't have to read them now, but you'll almost certainly want to refer to some of this material when reading and writing x86 assembly.
</p>

<p>
We do recommend reading the section "The Syntax" in Brennan's Guide to Inline Assembly. 
It gives a good (and quite brief) description of the AT&amp;T assembly syntax we'll be using with the GNU assembler in JOS.
</p>
</blockquote>

<p>
<a href="http://www.delorie.com/djgpp/doc/brennan/brennan_att_inline_djgpp.html">Brennan's Guide to Inline Assembly</a> is nice for both intel and AT&amp;T syntax(I prefer intel).
The <span class="underline">PCASM book</span> helps me a lot!
</p>

<p>
Finally, I am comfortable with most of assembly programs, but still lack experience and have some problems at use of
<code>in</code> and <code>out</code> commands&#x2026;
</p>
</div>
</div>
