Note/MIT6.828.lab1.org
*** The PC's Physical Address Space
#+BEGIN_SRC 
+------------------+  <- 0xFFFFFFFF (4GB)
|      32-bit      |
|  memory mapped   |
|     devices      |
|                  |
/\/\/\/\/\/\/\/\/\/\

/\/\/\/\/\/\/\/\/\/\
|                  |
|      Unused      |
|                  |
+------------------+  <- depends on amount of RAM
|                  |
|                  |
| Extended Memory  |
|                  |
|                  |
+------------------+  <- 0x00100000 (1MB)
|     BIOS ROM     |
+------------------+  <- 0x000F0000 (960KB)
|  16-bit devices, |
|  expansion ROMs  |
+------------------+  <- 0x000C0000 (768KB)
|   VGA Display    |
+------------------+  <- 0x000A0000 (640KB)
|                  |
|    Low Memory    |
|                  |
+------------------+  <- 0x00000000
#+END_SRC
This general picture of memory is important.

The layout exposes design compromise due to back compatibility.
To allow old PCs of 16bits, we still maintain the layout of 0x0 ~ 0x100000(old 8086 has 1MB space)

The BIOS ROM is first loaded into memory and then be executed when a computer powers on.
Let's inspect how BIOS is loaded and executed and eventually die out...

Simulate our qemu!
The following line:
#+BEGIN_SRC 
[f000:fff0] 0xffff0:	ljmp   $0xf000,$0xe05b
#+END_SRC
is GDB's disassembly of the first instruction to be executed. From this output you can conclude a few things:

- The IBM PC starts executing at physical address 0x000ffff0, which is at the very top of the 64KB area reserved for the ROM BIOS.
- The PC starts executing with CS = 0xf000 and IP = 0xfff0.
- The first instruction to be executed is a jmp instruction, which jumps to the segmented address CS = 0xf000 and IP = 0xe05b.

Well this looks weird, why at 0xffff0? why have to first execute at 0xffff0 and immediately jump to 0xfe05b?
Firstly, the BIOS in a PC is "hard-wired" to the physical address range 0x000f0000-0x000fffff, 
this design ensures that the BIOS always gets control of the machine first after power-up or any system restart.
Second, on processor reset, the (simulated) processor enters real mode and sets CS to 0xf000 and the IP to 0xfff0, 
so that execution begins at that (CS:IP) segment address.

*** Exercise 2
#+BEGIN_QUOTE
Use GDB's si (Step Instruction) command to trace into the ROM BIOS for a few more instructions, 
and try to guess what it might be doing. 

You might want to look at Phil Storrs I/O Ports Description, 
as well as other materials on the 6.828 reference materials page. 
No need to figure out all the details - just the general idea of what the BIOS is doing first.
#+END_QUOTE
OK, just the general idea:)

#+BEGIN_SRC 
The target architecture is assumed to be i8086
[f000:fff0]    0xffff0:	ljmp   $0xf000,$0xe05b
0x0000fff0 in ?? ()
+ symbol-file obj/kern/kernel
(gdb) si
[f000:e05b]    0xfe05b:	cmpl   $0x0,%cs:0x6ac8
0x0000e05b in ?? ()
(gdb) si
[f000:e062]    0xfe062:	jne    0xfd2e1
0x0000e062 in ?? ()
(gdb) si
[f000:e066]    0xfe066:	xor    %dx,%dx
0x0000e066 in ?? ()
(gdb) si
[f000:e068]    0xfe068:	mov    %dx,%ss
0x0000e068 in ?? ()
(gdb) 
...
#+END_SRC
When the BIOS runs, it sets up an interrupt descriptor table and initializes various devices such as the VGA display. 
This is where the "Starting SeaBIOS" message you see in the QEMU window comes from.

** Part 2: The Boot Loader
*** Exercise 3
#+BEGIN_QUOTE
Take a look at the lab tools guide, especially the section on GDB commands. 
Even if you're familiar with GDB, this includes some esoteric GDB commands that are useful for OS work.

Set a breakpoint at address 0x7c00, which is where the boot sector will be loaded. 
Continue execution until that breakpoint. Trace through the code in boot/boot.S, 
using the source code and the disassembly file obj/boot/boot.asm to keep track of where you are. 
Also use the x/i command in GDB to disassemble sequences of instructions in the boot loader, 
and compare the original boot loader source code with both the disassembly in obj/boot/boot.asm and GDB.

Trace into bootmain() in boot/main.c, and then into readsect(). 
Identify the exact assembly instructions that correspond to each of the statements in readsect(). 
Trace through the rest of readsect() and back out into bootmain(), 
and identify the begin and end of the for loop that reads the remaining sectors of the kernel from the disk. 
Find out what code will run when the loop is finished, set a breakpoint there, and continue to that breakpoint. 
Then step through the remainder of the boot loader.
#+END_QUOTE

**** GDB useful instructions
| Ctrl-c           | Halt the machine                                                                                  |
| continue         | Continue execution until the next breakpoint or Ctrl-c                                            |
| c                | same as continue                                                                                  |
| stepi            | Execute one machine instruction                                                                   |
| si               | same as stepi                                                                                     |
| b function       | Set a breakpoint at the given function or line                                                    |
| b file:line      | same as above                                                                                     |
| breakpoint       | as above                                                                                          |
| b *addr          | Set a breakpoint at the EIP addr                                                                  |
| set print pretty | Enable pretty-printing of arrays and structs                                                      |
| info registers   | Print the general purpose registers, eip, eflags, and the segment selectors                       |
| x/Nx addr        | Display a hex dump of N words starting at virtual address addr. If N is omitted, it defaults to 1 |
| x/Ni addr        | Display the N assembly instructions starting at addr                                              |
| symbol-file file | Switch to symbol file file                                                                        |
| thread n         | focus to thread n                                                                                 |
| info threads     | List all threads                                                                                  |

Mostly, we will only use =c= and =b= and =x/N= .

