Note/MIT6.828.lab1.html

<div id="outline-container-orgfcca574" class="outline-3">
<h3 id="orgfcca574"><span class="section-number-3">2.2</span> The PC's Physical Address Space</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example">
+------------------+  &lt;- 0xFFFFFFFF (4GB)
|      32-bit      |
|  memory mapped   |
|     devices      |
|                  |
/\/\/\/\/\/\/\/\/\/\

/\/\/\/\/\/\/\/\/\/\
|                  |
|      Unused      |
|                  |
+------------------+  &lt;- depends on amount of RAM
|                  |
|                  |
| Extended Memory  |
|                  |
|                  |
+------------------+  &lt;- 0x00100000 (1MB)
|     BIOS ROM     |
+------------------+  &lt;- 0x000F0000 (960KB)
|  16-bit devices, |
|  expansion ROMs  |
+------------------+  &lt;- 0x000C0000 (768KB)
|   VGA Display    |
+------------------+  &lt;- 0x000A0000 (640KB)
|                  |
|    Low Memory    |
|                  |
+------------------+  &lt;- 0x00000000
</pre>
<p>
This general picture of memory is important.
</p>

<p>
The layout exposes design compromise due to back compatibility.
To allow old PCs of 16bits, we still maintain the layout of 0x0 ~ 0x100000(old 8086 has 1MB space)
</p>

<p>
The BIOS ROM is first loaded into memory and then be executed when a computer powers on.
Let's inspect how BIOS is loaded and executed and eventually die out&#x2026;
</p>

<p>
Simulate our qemu!
The following line:
</p>
<pre class="example">
[f000:fff0] 0xffff0:	ljmp   $0xf000,$0xe05b
</pre>
<p>
is GDB's disassembly of the first instruction to be executed. From this output you can conclude a few things:
</p>

<ul class="org-ul">
<li>The IBM PC starts executing at physical address 0x000ffff0, which is at the very top of the 64KB area reserved for the ROM BIOS.</li>
<li>The PC starts executing with CS = 0xf000 and IP = 0xfff0.</li>
<li>The first instruction to be executed is a jmp instruction, which jumps to the segmented address CS = 0xf000 and IP = 0xe05b.</li>
</ul>

<p>
Well this looks weird, why at 0xffff0? why have to first execute at 0xffff0 and immediately jump to 0xfe05b?
Firstly, the BIOS in a PC is "hard-wired" to the physical address range 0x000f0000-0x000fffff, 
this design ensures that the BIOS always gets control of the machine first after power-up or any system restart.
Second, on processor reset, the (simulated) processor enters real mode and sets CS to 0xf000 and the IP to 0xfff0, 
so that execution begins at that (CS:IP) segment address.
</p>
</div>
</div>

<div id="outline-container-org6932729" class="outline-3">
<h3 id="org6932729"><span class="section-number-3">2.3</span> Exercise 2</h3>
<div class="outline-text-3" id="text-2-3">
<blockquote>
<p>
Use GDB's si (Step Instruction) command to trace into the ROM BIOS for a few more instructions, 
and try to guess what it might be doing. 
</p>

<p>
You might want to look at Phil Storrs I/O Ports Description, 
as well as other materials on the 6.828 reference materials page. 
No need to figure out all the details - just the general idea of what the BIOS is doing first.
</p>
</blockquote>
<p>
OK, just the general idea:)
</p>

<pre class="example">
The target architecture is assumed to be i8086
[f000:fff0]    0xffff0:	ljmp   $0xf000,$0xe05b
0x0000fff0 in ?? ()
+ symbol-file obj/kern/kernel
(gdb) si
[f000:e05b]    0xfe05b:	cmpl   $0x0,%cs:0x6ac8
0x0000e05b in ?? ()
(gdb) si
[f000:e062]    0xfe062:	jne    0xfd2e1
0x0000e062 in ?? ()
(gdb) si
[f000:e066]    0xfe066:	xor    %dx,%dx
0x0000e066 in ?? ()
(gdb) si
[f000:e068]    0xfe068:	mov    %dx,%ss
0x0000e068 in ?? ()
(gdb) 
...
</pre>
<p>
When the BIOS runs, it sets up an interrupt descriptor table and initializes various devices such as the VGA display. 
This is where the "Starting SeaBIOS" message you see in the QEMU window comes from.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd10fd1d" class="outline-2">
<h2 id="orgd10fd1d"><span class="section-number-2">3</span> Part 2: The Boot Loader</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgc58b143" class="outline-3">
<h3 id="orgc58b143"><span class="section-number-3">3.1</span> Exercise 3</h3>
<div class="outline-text-3" id="text-3-1">
<blockquote>
<p>
Take a look at the lab tools guide, especially the section on GDB commands. 
Even if you're familiar with GDB, this includes some esoteric GDB commands that are useful for OS work.
</p>

<p>
Set a breakpoint at address 0x7c00, which is where the boot sector will be loaded. 
Continue execution until that breakpoint. Trace through the code in boot/boot.S, 
using the source code and the disassembly file obj/boot/boot.asm to keep track of where you are. 
Also use the x/i command in GDB to disassemble sequences of instructions in the boot loader, 
and compare the original boot loader source code with both the disassembly in obj/boot/boot.asm and GDB.
</p>

<p>
Trace into bootmain() in boot/main.c, and then into readsect(). 
Identify the exact assembly instructions that correspond to each of the statements in readsect(). 
Trace through the rest of readsect() and back out into bootmain(), 
and identify the begin and end of the for loop that reads the remaining sectors of the kernel from the disk. 
Find out what code will run when the loop is finished, set a breakpoint there, and continue to that breakpoint. 
Then step through the remainder of the boot loader.
</p>
</blockquote>
</div>

<div id="outline-container-orgf403c01" class="outline-4">
<h4 id="orgf403c01"><span class="section-number-4">3.1.1</span> GDB useful instructions</h4>
<div class="outline-text-4" id="text-3-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Ctrl-c</td>
<td class="org-left">Halt the machine</td>
</tr>

<tr>
<td class="org-left">continue</td>
<td class="org-left">Continue execution until the next breakpoint or Ctrl-c</td>
</tr>

<tr>
<td class="org-left">c</td>
<td class="org-left">same as continue</td>
</tr>

<tr>
<td class="org-left">stepi</td>
<td class="org-left">Execute one machine instruction</td>
</tr>

<tr>
<td class="org-left">si</td>
<td class="org-left">same as stepi</td>
</tr>

<tr>
<td class="org-left">b function</td>
<td class="org-left">Set a breakpoint at the given function or line</td>
</tr>

<tr>
<td class="org-left">b <a href="line">line</a></td>
<td class="org-left">same as above</td>
</tr>

<tr>
<td class="org-left">breakpoint</td>
<td class="org-left">as above</td>
</tr>

<tr>
<td class="org-left">b *addr</td>
<td class="org-left">Set a breakpoint at the EIP addr</td>
</tr>

<tr>
<td class="org-left">set print pretty</td>
<td class="org-left">Enable pretty-printing of arrays and structs</td>
</tr>

<tr>
<td class="org-left">info registers</td>
<td class="org-left">Print the general purpose registers, eip, eflags, and the segment selectors</td>
</tr>

<tr>
<td class="org-left">x/Nx addr</td>
<td class="org-left">Display a hex dump of N words starting at virtual address addr. If N is omitted, it defaults to 1</td>
</tr>

<tr>
<td class="org-left">x/Ni addr</td>
<td class="org-left">Display the N assembly instructions starting at addr</td>
</tr>

<tr>
<td class="org-left">symbol-file file</td>
<td class="org-left">Switch to symbol file file</td>
</tr>

<tr>
<td class="org-left">thread n</td>
<td class="org-left">focus to thread n</td>
</tr>

<tr>
<td class="org-left">info threads</td>
<td class="org-left">List all threads</td>
</tr>
</tbody>
</table>

<p>
Mostly, we will only use <code>c</code> and <code>b</code> and <code>x/N</code> .
</p>
</div>
</div>
