Note/MIT6.828.lab1.org
**** Trace 0x7C00
#+BEGIN_SRC 
(gdb) b *0x7C00
Breakpoint 1 at 0x7c00
(gdb) c
Continuing.
[   0:7c00] => 0x7c00:	cli    

Breakpoint 1, 0x00007c00 in ?? ()
(gdb) x/i 0x7c00
=> 0x7c00:	cli    
(gdb) (gdb) x/21i 0x7c00
=> 0x7c00:	cli    
   0x7c01:	cld    
   0x7c02:	xor    %ax,%ax
   0x7c04:	mov    %ax,%ds
   0x7c06:	mov    %ax,%es
   0x7c08:	mov    %ax,%ss
   0x7c0a:	in     $0x64,%al
   0x7c0c:	test   $0x2,%al
   0x7c0e:	jne    0x7c0a
   0x7c10:	mov    $0xd1,%al
   0x7c12:	out    %al,$0x64
   0x7c14:	in     $0x64,%al
   0x7c16:	test   $0x2,%al
   0x7c18:	jne    0x7c14
   0x7c1a:	mov    $0xdf,%al
   0x7c1c:	out    %al,$0x60
   0x7c1e:	lgdtw  0x7c64
   0x7c23:	mov    %cr0,%eax
   0x7c26:	or     $0x1,%eax
   0x7c2a:	mov    %eax,%cr0
   0x7c2d:	ljmp   $0x8,$0x7c32
...
#+END_SRC
The first few lines from 0x7c00 is just the same as code in /boot.S/ .
There are some codes need to focus on.
1. =ljmp $0x8,$0x7c32=
   The original assembly code is =ljmp    $PROT_MODE_CSEG, $protcseg= where
   =.set PROT_MODE_CSEG, 0x8         # kernel code segment selector=. 
   The GDT code is:
   #+BEGIN_SRC 
   gdt:
     SEG_NULL                              # null seg
     SEG(STA_X|STA_R, 0x0, 0xffffffff)     # code seg
     SEG(STA_W, 0x0, 0xffffffff)           # data seg
   #+END_SRC
   Here we can see that the logical addr =0x8= is mapped to =0x0=.
   Therefore although we have GDT, the following code we're using is still mapped
   directly to %eip.

2. Let's focus on bootmain next... 
   #+BEGIN_SRC 
   (gdb) x/5i 0x7c40
      0x7c40:	mov    $0x7c00,%sp
      0x7c43:	add    %al,(%bx,%si)
      0x7c45:	call   0x7d13
      0x7c48:	add    %al,(%bx,%si)
      0x7c4a:	jmp    0x7c4a
   #+END_SRC
   The origin is
   #+BEGIN_SRC 
   # Set up the stack pointer and call into C.
    movl    $start, %esp
    call bootmain

   # If bootmain returns (it shouldn't), loop.
  spin:
    jmp spin
   #+END_SRC
   Since we are in assembly, we need to set %esp by hand to =0x7c00(function call conventions)=.
   =bootmain= is at =0x7d13=.
   - What does =add    %al,(%bx,%si)= do here?

     it could be a bunch of data that the de-compiler is having trouble with...
     more likely, its just the header or footer information that comes with every executable...

**** Trace bootmain and readect
- bootmain code
#+BEGIN_SRC c
void
bootmain(void)
{
        struct Proghdr *ph, *eph;

	// read 1st page off disk                                               
        readseg((uint32_t) ELFHDR, SECTSIZE*8, 0);

        // is this a valid ELF?                                                 
	if (ELFHDR->e_magic != ELF_MAGIC)
                goto bad;

        // load each program segment (ignores ph flags)                         
        ph = (struct Proghdr *) ((uint8_t *) ELFHDR + ELFHDR->e_phoff);
        eph = ph + ELFHDR->e_phnum;
        for (; ph < eph; ph++)
                // p_pa is the load address of this segment (as well            
                // as the physical address)                                     
                readseg(ph->p_pa, ph->p_memsz, ph->p_offset);

        // call the entry point from the ELF header                             
        // note: does not return!                                               
        ((void (*)(void)) (ELFHDR->e_entry))();

bad:
        outw(0x8A00, 0x8A00);
        outw(0x8A00, 0x8E00);
	while (1)
                /* do nothing */;
}

#+END_SRC
Later we will figure out where the kernel will be loaded.
#+BEGIN_SRC 
(gdb) x/10i 0x7d15
=> 0x7d15:	push   %ebp
   0x7d16:	mov    %esp,%ebp
   0x7d18:	push   %esi
   0x7d19:	push   %ebx
   0x7d1a:	push   $0x0
   0x7d1c:	push   $0x1000
   0x7d21:	push   $0x10000
   0x7d26:	call   0x7cdc
   0x7d2b:	add    $0xc,%esp
   0x7d2e:	cmpl   $0x464c457f,0x10000
...
#+END_SRC
The for loop checks eph range each loop.

**** Questions
- At what point does the processor start executing 32-bit code? What exactly causes the switch from 16- to 32-bit mode?

  At the point after =ljmp    $PROT_MODE_CSEG, $protcseg=.
  Change %cr0 exactly causes the switch.


- What is the last instruction of the boot loader executed, and what is the first instruction of the kernel it just loaded?

  Last instruction(if no fault): =((void (*)(void)) (ELFHDR->e_entry))();=.
  First instruction of kernel: =movw $0x1234,0x472=.

- Where is the first instruction of the kernel?

  as above

- How does the boot loader decide how many sectors it must read in order to fetch the entire kernel from disk? 
  Where does it find this information?

  from the variable =ELFHDR->e_phoff=.

*** Loading the kernel
