Note/MIT6.828.lab1.html

<div id="outline-container-org8d24aba" class="outline-4">
<h4 id="org8d24aba"><span class="section-number-4">3.1.2</span> Trace 0x7C00</h4>
<div class="outline-text-4" id="text-3-1-2">
<pre class="example">
(gdb) b *0x7C00
Breakpoint 1 at 0x7c00
(gdb) c
Continuing.
[   0:7c00] =&gt; 0x7c00:	cli    

Breakpoint 1, 0x00007c00 in ?? ()
(gdb) x/i 0x7c00
=&gt; 0x7c00:	cli    
(gdb) (gdb) x/21i 0x7c00
=&gt; 0x7c00:	cli    
   0x7c01:	cld    
   0x7c02:	xor    %ax,%ax
   0x7c04:	mov    %ax,%ds
   0x7c06:	mov    %ax,%es
   0x7c08:	mov    %ax,%ss
   0x7c0a:	in     $0x64,%al
   0x7c0c:	test   $0x2,%al
   0x7c0e:	jne    0x7c0a
   0x7c10:	mov    $0xd1,%al
   0x7c12:	out    %al,$0x64
   0x7c14:	in     $0x64,%al
   0x7c16:	test   $0x2,%al
   0x7c18:	jne    0x7c14
   0x7c1a:	mov    $0xdf,%al
   0x7c1c:	out    %al,$0x60
   0x7c1e:	lgdtw  0x7c64
   0x7c23:	mov    %cr0,%eax
   0x7c26:	or     $0x1,%eax
   0x7c2a:	mov    %eax,%cr0
   0x7c2d:	ljmp   $0x8,$0x7c32
...
</pre>
<p>
The first few lines from 0x7c00 is just the same as code in <i>boot.S</i> .
There are some codes need to focus on.
</p>
<ol class="org-ol">
<li><p>
<code>ljmp $0x8,$0x7c32</code>
The original assembly code is <code>ljmp    $PROT_MODE_CSEG, $protcseg</code> where
<code>.set PROT_MODE_CSEG, 0x8         # kernel code segment selector</code>. 
The GDT code is:
</p>
<pre class="example">
   gdt:
     SEG_NULL                              # null seg
     SEG(STA_X|STA_R, 0x0, 0xffffffff)     # code seg
     SEG(STA_W, 0x0, 0xffffffff)           # data seg
</pre>
<p>
Here we can see that the logical addr <code>0x8</code> is mapped to <code>0x0</code>.
Therefore although we have GDT, the following code we're using is still mapped
directly to %eip.
</p></li>

<li><p>
Let's focus on bootmain next&#x2026; 
</p>
<pre class="example">
   (gdb) x/5i 0x7c40
      0x7c40:	mov    $0x7c00,%sp
      0x7c43:	add    %al,(%bx,%si)
      0x7c45:	call   0x7d13
      0x7c48:	add    %al,(%bx,%si)
      0x7c4a:	jmp    0x7c4a
</pre>
<p>
The origin is
</p>
<pre class="example">
   # Set up the stack pointer and call into C.
    movl    $start, %esp
    call bootmain

   # If bootmain returns (it shouldn't), loop.
  spin:
    jmp spin
</pre>
<p>
Since we are in assembly, we need to set %esp by hand to <code>0x7c00(function call conventions)</code>.
<code>bootmain</code> is at <code>0x7d13</code>.
</p>
<ul class="org-ul">
<li><p>
What does <code>add    %al,(%bx,%si)</code> do here?
</p>

<p>
it could be a bunch of data that the de-compiler is having trouble with&#x2026;
more likely, its just the header or footer information that comes with every executable&#x2026;
</p></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org21d3002" class="outline-4">
<h4 id="org21d3002"><span class="section-number-4">3.1.3</span> Trace bootmain and readect</h4>
<div class="outline-text-4" id="text-3-1-3">
<ul class="org-ul">
<li>bootmain code</li>
</ul>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #8ae234; font-weight: bold;">void</span>
<span style="color: #edd400; font-weight: bold;">bootmain</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">void</span><span style="color: #ffd700;">)</span>
<span style="color: #ffd700;">{</span>
        <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Proghdr</span> *<span style="color: #ff6347; font-weight: bold;">ph</span>, *<span style="color: #ff6347; font-weight: bold;">eph</span>;

        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">read 1st page off disk                                               </span>
        readseg<span style="color: #00bfff;">(</span><span style="color: #ffa500;">(</span><span style="color: #8ae234; font-weight: bold;">uint32_t</span><span style="color: #ffa500;">)</span> ELFHDR, SECTSIZE*8, 0<span style="color: #00bfff;">)</span>;

        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">is this a valid ELF?                                                 </span>
        <span style="color: #729fcf; font-weight: bold;">if</span> <span style="color: #00bfff;">(</span>ELFHDR-&gt;e_magic != ELF_MAGIC<span style="color: #00bfff;">)</span>
                <span style="color: #729fcf; font-weight: bold;">goto</span> <span style="color: #8ae234; font-weight: bold;">bad</span>;

        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">load each program segment (ignores ph flags)                         </span>
        ph = <span style="color: #00bfff;">(</span><span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Proghdr</span> *<span style="color: #00bfff;">)</span> <span style="color: #00bfff;">(</span><span style="color: #ffa500;">(</span><span style="color: #8ae234; font-weight: bold;">uint8_t</span> *<span style="color: #ffa500;">)</span> ELFHDR + ELFHDR-&gt;e_phoff<span style="color: #00bfff;">)</span>;
        eph = ph + ELFHDR-&gt;e_phnum;
        <span style="color: #729fcf; font-weight: bold;">for</span> <span style="color: #00bfff;">(</span>; ph &lt; eph; ph++<span style="color: #00bfff;">)</span>
                <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">p_pa is the load address of this segment (as well            </span>
                <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">as the physical address)                                     </span>
                readseg<span style="color: #00bfff;">(</span>ph-&gt;p_pa, ph-&gt;p_memsz, ph-&gt;p_offset<span style="color: #00bfff;">)</span>;

        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">call the entry point from the ELF header                             </span>
        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">note: does not return!                                               </span>
        <span style="color: #00bfff;">(</span><span style="color: #ffa500;">(</span><span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #ff7f50;">(</span>*<span style="color: #ff7f50;">)(</span><span style="color: #8ae234; font-weight: bold;">void</span><span style="color: #ff7f50;">)</span><span style="color: #ffa500;">)</span> <span style="color: #ffa500;">(</span>ELFHDR-&gt;e_entry<span style="color: #ffa500;">)</span><span style="color: #00bfff;">)()</span>;

<span style="color: #8ae234; font-weight: bold;">bad</span>:
        outw<span style="color: #00bfff;">(</span>0x8A00, 0x8A00<span style="color: #00bfff;">)</span>;
        outw<span style="color: #00bfff;">(</span>0x8A00, 0x8E00<span style="color: #00bfff;">)</span>;
        <span style="color: #729fcf; font-weight: bold;">while</span> <span style="color: #00bfff;">(</span>1<span style="color: #00bfff;">)</span>
                <span style="color: #888a85; font-style: italic;">/* </span><span style="color: #888a85; font-style: italic;">do nothing </span><span style="color: #888a85; font-style: italic;">*/</span>;
<span style="color: #ffd700;">}</span>

</pre>
</div>
<p>
Later we will figure out where the kernel will be loaded.
</p>
<pre class="example">
(gdb) x/10i 0x7d15
=&gt; 0x7d15:	push   %ebp
   0x7d16:	mov    %esp,%ebp
   0x7d18:	push   %esi
   0x7d19:	push   %ebx
   0x7d1a:	push   $0x0
   0x7d1c:	push   $0x1000
   0x7d21:	push   $0x10000
   0x7d26:	call   0x7cdc
   0x7d2b:	add    $0xc,%esp
   0x7d2e:	cmpl   $0x464c457f,0x10000
...
</pre>
<p>
The for loop checks eph range each loop.
</p>
</div>
</div>

<div id="outline-container-org86c021d" class="outline-4">
<h4 id="org86c021d"><span class="section-number-4">3.1.4</span> Questions</h4>
<div class="outline-text-4" id="text-3-1-4">
<ul class="org-ul">
<li><p>
At what point does the processor start executing 32-bit code? What exactly causes the switch from 16- to 32-bit mode?
</p>

<p>
At the point after <code>ljmp    $PROT_MODE_CSEG, $protcseg</code>.
Change %cr0 exactly causes the switch.
</p></li>
</ul>


<ul class="org-ul">
<li><p>
What is the last instruction of the boot loader executed, and what is the first instruction of the kernel it just loaded?
</p>

<p>
Last instruction(if no fault): <code>((void (*)(void)) (ELFHDR-&gt;e_entry))();</code>.
First instruction of kernel: <code>movw $0x1234,0x472</code>.
</p></li>

<li><p>
Where is the first instruction of the kernel?
</p>

<p>
as above
</p></li>

<li><p>
How does the boot loader decide how many sectors it must read in order to fetch the entire kernel from disk? 
Where does it find this information?
</p>

<p>
from the variable <code>ELFHDR-&gt;e_phoff</code>.
</p></li>
</ul>
</div>
</div>
</div>
