Note/MIT6.828.lab1.org
**** Exercise 5
#+BEGIN_QUOTE
Exercise 4. Read about programming with pointers in C. 
The best reference for the C language is The C Programming Language by Brian Kernighan and Dennis Ritchie (known as 'K&R'). 
We recommend that students purchase this book (here is an Amazon Link) or find one of MIT's 7 copies.

Read 5.1 (Pointers and Addresses) through 5.5 (Character Pointers and Functions) in K&R. 
Then download the code for pointers.c, run it, and make sure you understand where all of the printed values come from. 
In particular, make sure you understand where the pointer addresses in printed lines 1 and 6 come from, 
how all the values in printed lines 2 through 4 get there, and why the values printed in line 5 are seemingly corrupted.

There are other references on pointers in C (e.g., A tutorial by Ted Jensen that cites K&R heavily), though not as strongly recommended.

Warning: Unless you are already thoroughly versed in C, do not skip or even skim this reading exercise. 
If you do not really understand pointers in C, you will suffer untold pain and misery in subsequent labs, 
and then eventually come to understand them the hard way. Trust us; you don't want to find out what "the hard way" is.
#+END_QUOTE
The hard way...emmmmm seems intereting (

I think I am already familiar with C pointers, but, just in case, Let's check knowledge by this exercise.

Code of /pointers.c/.
#+BEGIN_SRC c
#include <stdio.h>
#include <stdlib.h>

void
f(void)
{
    int a[4];
    int *b = malloc(16);
    int *c;
    int i;

    printf("1: a = %p, b = %p, c = %p\n", a, b, c);

    c = a;
    for (i = 0; i < 4; i++)
	a[i] = 100 + i;
    c[0] = 200;
    printf("2: a[0] = %d, a[1] = %d, a[2] = %d, a[3] = %d\n",
	   a[0], a[1], a[2], a[3]);

    c[1] = 300;
    *(c + 2) = 301;
    3[c] = 302;
    printf("3: a[0] = %d, a[1] = %d, a[2] = %d, a[3] = %d\n",
	   a[0], a[1], a[2], a[3]);

    c = c + 1;
    *c = 400;
    printf("4: a[0] = %d, a[1] = %d, a[2] = %d, a[3] = %d\n",
	   a[0], a[1], a[2], a[3]);

    c = (int *) ((char *) c + 1);
    *c = 500;
    printf("5: a[0] = %d, a[1] = %d, a[2] = %d, a[3] = %d\n",
	   a[0], a[1], a[2], a[3]);

    b = (int *) a + 1;
    c = (int *) ((char *) a + 1);
    printf("6: a = %p, b = %p, c = %p\n", a, b, c);
}

int
main(int ac, char **av)
{
    f();
    return 0;
}

#+END_SRC
Result:
#+BEGIN_SRC 
1: a = 0x7ffeeb8b9970, b = 0x7fcb43405800, c = 0x7ffeeb8b99d8
2: a[0] = 200, a[1] = 101, a[2] = 102, a[3] = 103
3: a[0] = 200, a[1] = 300, a[2] = 301, a[3] = 302
4: a[0] = 200, a[1] = 400, a[2] = 301, a[3] = 302
5: a[0] = 200, a[1] = 128144, a[2] = 256, a[3] = 302
6: a = 0x7ffeeb8b9970, b = 0x7ffeeb8b9974, c = 0x7ffeeb8b9971
#+END_SRC
Well I'm done, how about u?

**** ELF format
- *.text*: The program's executable instructions.
- *.rodata*: Read-only data, such as ASCII string constants produced by the C compiler.
- *.data*: The data section holds the program's initialized data, such as global variables declared with initializers like int x = 5;.
- *.bss*: "uninitialized" global variables start with a value of zero

Let's try this command:
#+BEGIN_SRC 
$ objdump -h obj/kern/kernel
#+END_SRC
#+BEGIN_SRC 
obj/kern/kernel:     file format elf32-i386

Sections:
Idx Name          Size      VMA       LMA       File off  Algn
  0 .text         000019e9  f0100000  00100000  00001000  2**4
                  CONTENTS, ALLOC, LOAD, READONLY, CODE
  1 .rodata       000006c0  f0101a00  00101a00  00002a00  2**5
                  CONTENTS, ALLOC, LOAD, READONLY, DATA
  2 .stab         00003b95  f01020c0  001020c0  000030c0  2**2
                  CONTENTS, ALLOC, LOAD, READONLY, DATA
  3 .stabstr      00001948  f0105c55  00105c55  00006c55  2**0
                  CONTENTS, ALLOC, LOAD, READONLY, DATA
  4 .data         00009300  f0108000  00108000  00009000  2**12
                  CONTENTS, ALLOC, LOAD, DATA
  5 .got          00000008  f0111300  00111300  00012300  2**2
                  CONTENTS, ALLOC, LOAD, DATA
  6 .got.plt      0000000c  f0111308  00111308  00012308  2**2
                  CONTENTS, ALLOC, LOAD, DATA
  7 .data.rel.local 00001000  f0112000  00112000  00013000  2**12
                  CONTENTS, ALLOC, LOAD, DATA
  8 .data.rel.ro.local 00000044  f0113000  00113000  00014000  2**2
                  CONTENTS, ALLOC, LOAD, DATA
  9 .bss          00000648  f0113060  00113060  00014060  2**5
                  CONTENTS, ALLOC, LOAD, DATA
 10 .comment      00000029  00000000  00000000  000146a8  2**0
                  CONTENTS, READONLY
#+END_SRC
Several things to notice:
1) "VMA" (or link address) and the "LMA" (or load address) of the .text section.
   VMA and LMA often the same, why not here(we will rediscuss this in the part 3).

well, just a general concept here, I shall study in-depth when I review compiler theories again.

