Note/MIT6.828.lab1.html

<div id="outline-container-org2e74333" class="outline-3">
<h3 id="org2e74333"><span class="section-number-3">3.2</span> Loading the kernel</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orgeae11c7" class="outline-4">
<h4 id="orgeae11c7"><span class="section-number-4">3.2.1</span> Exercise 5</h4>
<div class="outline-text-4" id="text-3-2-1">
<blockquote>
<p>
Exercise 4. Read about programming with pointers in C. 
The best reference for the C language is The C Programming Language by Brian Kernighan and Dennis Ritchie (known as 'K&amp;R'). 
We recommend that students purchase this book (here is an Amazon Link) or find one of MIT's 7 copies.
</p>

<p>
Read 5.1 (Pointers and Addresses) through 5.5 (Character Pointers and Functions) in K&amp;R. 
Then download the code for pointers.c, run it, and make sure you understand where all of the printed values come from. 
In particular, make sure you understand where the pointer addresses in printed lines 1 and 6 come from, 
how all the values in printed lines 2 through 4 get there, and why the values printed in line 5 are seemingly corrupted.
</p>

<p>
There are other references on pointers in C (e.g., A tutorial by Ted Jensen that cites K&amp;R heavily), though not as strongly recommended.
</p>

<p>
Warning: Unless you are already thoroughly versed in C, do not skip or even skim this reading exercise. 
If you do not really understand pointers in C, you will suffer untold pain and misery in subsequent labs, 
and then eventually come to understand them the hard way. Trust us; you don't want to find out what "the hard way" is.
</p>
</blockquote>
<p>
The hard way&#x2026;emmmmm seems intereting (
</p>

<p>
I think I am already familiar with C pointers, but, just in case, Let's check knowledge by this exercise.
</p>

<p>
Code of <i>pointers.c</i>.
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #729fcf;">#include</span> <span style="color: #ffd700; font-style: italic;">&lt;</span><span style="color: #ad7fa8; font-style: italic;">stdio.h</span><span style="color: #ffd700; font-style: italic;">&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ffd700; font-style: italic;">&lt;</span><span style="color: #ad7fa8; font-style: italic;">stdlib.h</span><span style="color: #ffd700; font-style: italic;">&gt;</span>

<span style="color: #8ae234; font-weight: bold;">void</span>
<span style="color: #edd400; font-weight: bold;">f</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">void</span><span style="color: #ffd700;">)</span>
<span style="color: #ffd700;">{</span>
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">a</span><span style="color: #00bfff;">[</span>4<span style="color: #00bfff;">]</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> *<span style="color: #ff6347; font-weight: bold;">b</span> = malloc<span style="color: #00bfff;">(</span>16<span style="color: #00bfff;">)</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> *<span style="color: #ff6347; font-weight: bold;">c</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">i</span>;

    printf<span style="color: #00bfff;">(</span><span style="color: #ad7fa8; font-style: italic;">"1: a = %p, b = %p, c = %p\n"</span>, a, b, c<span style="color: #00bfff;">)</span>;

    c = a;
    <span style="color: #729fcf; font-weight: bold;">for</span> <span style="color: #00bfff;">(</span>i = 0; i &lt; 4; i++<span style="color: #00bfff;">)</span>
        a<span style="color: #00bfff;">[</span>i<span style="color: #00bfff;">]</span> = 100 + i;
    c<span style="color: #00bfff;">[</span>0<span style="color: #00bfff;">]</span> = 200;
    printf<span style="color: #00bfff;">(</span><span style="color: #ad7fa8; font-style: italic;">"2: a[0] = %d, a[1] = %d, a[2] = %d, a[3] = %d\n"</span>,
           a<span style="color: #ffa500;">[</span>0<span style="color: #ffa500;">]</span>, a<span style="color: #ffa500;">[</span>1<span style="color: #ffa500;">]</span>, a<span style="color: #ffa500;">[</span>2<span style="color: #ffa500;">]</span>, a<span style="color: #ffa500;">[</span>3<span style="color: #ffa500;">]</span><span style="color: #00bfff;">)</span>;

    c<span style="color: #00bfff;">[</span>1<span style="color: #00bfff;">]</span> = 300;
    *<span style="color: #00bfff;">(</span>c + 2<span style="color: #00bfff;">)</span> = 301;
    3<span style="color: #00bfff;">[</span>c<span style="color: #00bfff;">]</span> = 302;
    printf<span style="color: #00bfff;">(</span><span style="color: #ad7fa8; font-style: italic;">"3: a[0] = %d, a[1] = %d, a[2] = %d, a[3] = %d\n"</span>,
           a<span style="color: #ffa500;">[</span>0<span style="color: #ffa500;">]</span>, a<span style="color: #ffa500;">[</span>1<span style="color: #ffa500;">]</span>, a<span style="color: #ffa500;">[</span>2<span style="color: #ffa500;">]</span>, a<span style="color: #ffa500;">[</span>3<span style="color: #ffa500;">]</span><span style="color: #00bfff;">)</span>;

    c = c + 1;
    *c = 400;
    printf<span style="color: #00bfff;">(</span><span style="color: #ad7fa8; font-style: italic;">"4: a[0] = %d, a[1] = %d, a[2] = %d, a[3] = %d\n"</span>,
           a<span style="color: #ffa500;">[</span>0<span style="color: #ffa500;">]</span>, a<span style="color: #ffa500;">[</span>1<span style="color: #ffa500;">]</span>, a<span style="color: #ffa500;">[</span>2<span style="color: #ffa500;">]</span>, a<span style="color: #ffa500;">[</span>3<span style="color: #ffa500;">]</span><span style="color: #00bfff;">)</span>;

    c = <span style="color: #00bfff;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> *<span style="color: #00bfff;">)</span> <span style="color: #00bfff;">(</span><span style="color: #ffa500;">(</span><span style="color: #8ae234; font-weight: bold;">char</span> *<span style="color: #ffa500;">)</span> c + 1<span style="color: #00bfff;">)</span>;
    *c = 500;
    printf<span style="color: #00bfff;">(</span><span style="color: #ad7fa8; font-style: italic;">"5: a[0] = %d, a[1] = %d, a[2] = %d, a[3] = %d\n"</span>,
           a<span style="color: #ffa500;">[</span>0<span style="color: #ffa500;">]</span>, a<span style="color: #ffa500;">[</span>1<span style="color: #ffa500;">]</span>, a<span style="color: #ffa500;">[</span>2<span style="color: #ffa500;">]</span>, a<span style="color: #ffa500;">[</span>3<span style="color: #ffa500;">]</span><span style="color: #00bfff;">)</span>;

    b = <span style="color: #00bfff;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> *<span style="color: #00bfff;">)</span> a + 1;
    c = <span style="color: #00bfff;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> *<span style="color: #00bfff;">)</span> <span style="color: #00bfff;">(</span><span style="color: #ffa500;">(</span><span style="color: #8ae234; font-weight: bold;">char</span> *<span style="color: #ffa500;">)</span> a + 1<span style="color: #00bfff;">)</span>;
    printf<span style="color: #00bfff;">(</span><span style="color: #ad7fa8; font-style: italic;">"6: a = %p, b = %p, c = %p\n"</span>, a, b, c<span style="color: #00bfff;">)</span>;
<span style="color: #ffd700;">}</span>

<span style="color: #8ae234; font-weight: bold;">int</span>
<span style="color: #edd400; font-weight: bold;">main</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">ac</span>, <span style="color: #8ae234; font-weight: bold;">char</span> **<span style="color: #ff6347; font-weight: bold;">av</span><span style="color: #ffd700;">)</span>
<span style="color: #ffd700;">{</span>
    f<span style="color: #00bfff;">()</span>;
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
<span style="color: #ffd700;">}</span>

</pre>
</div>
<p>
Result:
</p>
<pre class="example">
1: a = 0x7ffeeb8b9970, b = 0x7fcb43405800, c = 0x7ffeeb8b99d8
2: a[0] = 200, a[1] = 101, a[2] = 102, a[3] = 103
3: a[0] = 200, a[1] = 300, a[2] = 301, a[3] = 302
4: a[0] = 200, a[1] = 400, a[2] = 301, a[3] = 302
5: a[0] = 200, a[1] = 128144, a[2] = 256, a[3] = 302
6: a = 0x7ffeeb8b9970, b = 0x7ffeeb8b9974, c = 0x7ffeeb8b9971
</pre>
<p>
Well I'm done, how about u?
</p>
</div>
</div>

<div id="outline-container-org01bcaa2" class="outline-4">
<h4 id="org01bcaa2"><span class="section-number-4">3.2.2</span> ELF format</h4>
<div class="outline-text-4" id="text-3-2-2">
<ul class="org-ul">
<li><b>.text</b>: The program's executable instructions.</li>
<li><b>.rodata</b>: Read-only data, such as ASCII string constants produced by the C compiler.</li>
<li><b>.data</b>: The data section holds the program's initialized data, such as global variables declared with initializers like int x = 5;.</li>
<li><b>.bss</b>: "uninitialized" global variables start with a value of zero</li>
</ul>

<p>
Let's try this command:
</p>
<pre class="example">
$ objdump -h obj/kern/kernel
</pre>
<pre class="example">
obj/kern/kernel:     file format elf32-i386

Sections:
Idx Name          Size      VMA       LMA       File off  Algn
  0 .text         000019e9  f0100000  00100000  00001000  2**4
                  CONTENTS, ALLOC, LOAD, READONLY, CODE
  1 .rodata       000006c0  f0101a00  00101a00  00002a00  2**5
                  CONTENTS, ALLOC, LOAD, READONLY, DATA
  2 .stab         00003b95  f01020c0  001020c0  000030c0  2**2
                  CONTENTS, ALLOC, LOAD, READONLY, DATA
  3 .stabstr      00001948  f0105c55  00105c55  00006c55  2**0
                  CONTENTS, ALLOC, LOAD, READONLY, DATA
  4 .data         00009300  f0108000  00108000  00009000  2**12
                  CONTENTS, ALLOC, LOAD, DATA
  5 .got          00000008  f0111300  00111300  00012300  2**2
                  CONTENTS, ALLOC, LOAD, DATA
  6 .got.plt      0000000c  f0111308  00111308  00012308  2**2
                  CONTENTS, ALLOC, LOAD, DATA
  7 .data.rel.local 00001000  f0112000  00112000  00013000  2**12
                  CONTENTS, ALLOC, LOAD, DATA
  8 .data.rel.ro.local 00000044  f0113000  00113000  00014000  2**2
                  CONTENTS, ALLOC, LOAD, DATA
  9 .bss          00000648  f0113060  00113060  00014060  2**5
                  CONTENTS, ALLOC, LOAD, DATA
 10 .comment      00000029  00000000  00000000  000146a8  2**0
                  CONTENTS, READONLY
</pre>
<p>
Several things to notice:
</p>
<ol class="org-ol">
<li>"VMA" (or link address) and the "LMA" (or load address) of the .text section.
VMA and LMA often the same, why not here(we will rediscuss this in the part 3).</li>
</ol>

<p>
well, just a general concept here, I shall study in-depth when I review compiler theories again.
</p>
</div>
</div>
