Note/MIT6.828.lab1.org
**** Exercise 5
#+BEGIN_QUOTE
Trace through the first few instructions of the boot loader again and identify the first instruction that 
would "break" or otherwise do the wrong thing if you were to get the boot loader's link address wrong. 
Then change the link address in boot/Makefrag to something wrong, run make clean, recompile the lab with make, 
and trace into the boot loader again to see what happens. Don't forget to change the link address back and make clean again afterward!
#+END_QUOTE

** Part 3: The Kernel
Kernel! Things going to become interesting!
Let's first try to figure out one remained question on _ELF format_ above:
#+BEGIN_QUOTE
Why VMA is different from LMA?
#+END_QUOTE
#+BEGIN_QUOTE
Operating system kernels often like to be linked and run at very high virtual address, such as 0xf0100000, 
in order to leave the lower part of the processor's virtual address space for user programs to use. 
The reason for this arrangement will become clearer in the next lab.
#+END_QUOTE
In fact, OS map virtual address 0xf0100000 (the link address at which the kernel code expects to run) 
to physical address 0x00100000 (where the boot loader loaded the kernel into physical memory).
Well, it seems we still have more work to do:)

*** Exercise 7
#+BEGIN_QUOTE
Use QEMU and GDB to trace into the JOS kernel and stop at the movl %eax, %cr0. 
Examine memory at 0x00100000 and at 0xf0100000. 
Now, single step over that instruction using the stepi GDB command. 
Again, examine memory at 0x00100000 and at 0xf0100000. Make sure you understand what just happened.

What is the first instruction after the new mapping is established that would fail to work properly if the mapping weren't in place? 
Comment out the movl %eax, %cr0 in kern/entry.S, trace into it, and see if you were right.
#+END_QUOTE
#+BEGIN_SRC
(gdb) b *0x10000c
Breakpoint 1 at 0x10000c
(gdb) c
Continuing.
The target architecture is assumed to be i386
=> 0x10000c:	movw   $0x1234,0x472

Breakpoint 1, 0x0010000c in ?? ()
(gdb) x/4i 0x00100000
   0x100000:	add    0x1bad(%eax),%dh
   0x100006:	add    %al,(%eax)
   0x100008:	decb   0x52(%edi)
   0x10000b:	in     $0x66,%al
(gdb) x/4i 0xf0100000
   0xf0100000 <_start+4026531828>:	add    %al,(%eax)
   0xf0100002 <_start+4026531830>:	add    %al,(%eax)
   0xf0100004 <_start+4026531832>:	add    %al,(%eax)
   0xf0100006 <_start+4026531834>:	add    %al,(%eax)
#+END_SRC

After several =si=...
#+BEGIN_SRC
(gdb) si
=> 0x100028:	mov    $0xf010002f,%eax
0x00100028 in ?? ()
(gdb) x/4i 0x00100000
   0x100000:	add    0x1bad(%eax),%dh
   0x100006:	add    %al,(%eax)
   0x100008:	decb   0x52(%edi)
   0x10000b:	in     $0x66,%al
(gdb) x/4i 0xf0100000
   0xf0100000 <_start+4026531828>:	add    0x1bad(%eax),%dh
   0xf0100006 <_start+4026531834>:	add    %al,(%eax)
   0xf0100008 <_start+4026531836>:	decb   0x52(%edi)
   0xf010000b <_start+4026531839>:	in     $0x66,%al
#+END_SRC
Address mapping done.

*** Formatted Printing to the Console
**** Exercise 8
#+BEGIN_QUOTE
We have omitted a small fragment of code - the code necessary to print octal numbers using patterns of the form "%o". 
Find and fill in this code fragment.
#+END_QUOTE
Well, it's easy to complete the code, but it's still alittle hard for me to understand every line here.

- =kern/printf.c= rely on =lib/printfmt.c= and =kern/console.c= .
- =lib/printfmt.c= rely on =kern/console.c= .

The most important part is here:
#+BEGIN_SRC c
// output a character to the console
static void
cons_putc(int c)
{
    serial_putc(c);
    lpt_putc(c);
    cga_putc(c);
}
#+END_SRC

Let's firstly finish the code and try to analyse more codes...
#+BEGIN_SRC c
case 'o':
    num = getuint(&ap, lflag);
    base = 8;
    goto number;
#+END_SRC

**** Explain the following code from =kern/console.c= .
#+BEGIN_SRC c
if (crt_pos >= CRT_SIZE) {
    int i;
    memmove(crt_buf, crt_buf + CRT_COLS, (CRT_SIZE - CRT_COLS) * sizeof(uint16_t));
    for (i = CRT_SIZE - CRT_COLS; i < CRT_SIZE; i++)
        crt_buf[i] = 0x0700 | ' ';
        crt_pos -= CRT_COLS;
}
#+END_SRC

*** The Stack
 Exploring in more detail the way the C language uses the stack on the x86.

