Note/MIT6.828.lab1.html

<div id="outline-container-org9bfdf99" class="outline-4">
<h4 id="org9bfdf99"><span class="section-number-4">3.2.3</span> Exercise 5</h4>
<div class="outline-text-4" id="text-3-2-3">
<blockquote>
<p>
Trace through the first few instructions of the boot loader again and identify the first instruction that 
would "break" or otherwise do the wrong thing if you were to get the boot loader's link address wrong. 
Then change the link address in boot/Makefrag to something wrong, run make clean, recompile the lab with make, 
and trace into the boot loader again to see what happens. Don't forget to change the link address back and make clean again afterward!
</p>
</blockquote>
</div>
</div>
</div>
</div>

<div id="outline-container-org58bac30" class="outline-2">
<h2 id="org58bac30"><span class="section-number-2">4</span> Part 3: The Kernel</h2>
<div class="outline-text-2" id="text-4">
<p>
Kernel! Things going to become interesting!
Let's first try to figure out one remained question on <span class="underline">ELF format</span> above:
</p>
<blockquote>
<p>
Why VMA is different from LMA?
</p>
</blockquote>
<blockquote>
<p>
Operating system kernels often like to be linked and run at very high virtual address, such as 0xf0100000, 
in order to leave the lower part of the processor's virtual address space for user programs to use. 
The reason for this arrangement will become clearer in the next lab.
</p>
</blockquote>
<p>
In fact, OS map virtual address 0xf0100000 (the link address at which the kernel code expects to run) 
to physical address 0x00100000 (where the boot loader loaded the kernel into physical memory).
Well, it seems we still have more work to do:)
</p>
</div>

<div id="outline-container-org59edb95" class="outline-3">
<h3 id="org59edb95"><span class="section-number-3">4.1</span> Exercise 7</h3>
<div class="outline-text-3" id="text-4-1">
<blockquote>
<p>
Use QEMU and GDB to trace into the JOS kernel and stop at the movl %eax, %cr0. 
Examine memory at 0x00100000 and at 0xf0100000. 
Now, single step over that instruction using the stepi GDB command. 
Again, examine memory at 0x00100000 and at 0xf0100000. Make sure you understand what just happened.
</p>

<p>
What is the first instruction after the new mapping is established that would fail to work properly if the mapping weren't in place? 
Comment out the movl %eax, %cr0 in kern/entry.S, trace into it, and see if you were right.
</p>
</blockquote>
<pre class="example">
(gdb) b *0x10000c
Breakpoint 1 at 0x10000c
(gdb) c
Continuing.
The target architecture is assumed to be i386
=&gt; 0x10000c:	movw   $0x1234,0x472

Breakpoint 1, 0x0010000c in ?? ()
(gdb) x/4i 0x00100000
   0x100000:	add    0x1bad(%eax),%dh
   0x100006:	add    %al,(%eax)
   0x100008:	decb   0x52(%edi)
   0x10000b:	in     $0x66,%al
(gdb) x/4i 0xf0100000
   0xf0100000 &lt;_start+4026531828&gt;:	add    %al,(%eax)
   0xf0100002 &lt;_start+4026531830&gt;:	add    %al,(%eax)
   0xf0100004 &lt;_start+4026531832&gt;:	add    %al,(%eax)
   0xf0100006 &lt;_start+4026531834&gt;:	add    %al,(%eax)
</pre>

<p>
After several <code>si</code>&#x2026;
</p>
<pre class="example">
(gdb) si
=&gt; 0x100028:	mov    $0xf010002f,%eax
0x00100028 in ?? ()
(gdb) x/4i 0x00100000
   0x100000:	add    0x1bad(%eax),%dh
   0x100006:	add    %al,(%eax)
   0x100008:	decb   0x52(%edi)
   0x10000b:	in     $0x66,%al
(gdb) x/4i 0xf0100000
   0xf0100000 &lt;_start+4026531828&gt;:	add    0x1bad(%eax),%dh
   0xf0100006 &lt;_start+4026531834&gt;:	add    %al,(%eax)
   0xf0100008 &lt;_start+4026531836&gt;:	decb   0x52(%edi)
   0xf010000b &lt;_start+4026531839&gt;:	in     $0x66,%al
</pre>
<p>
Address mapping done.
</p>
</div>
</div>

<div id="outline-container-org3493dce" class="outline-3">
<h3 id="org3493dce"><span class="section-number-3">4.2</span> Formatted Printing to the Console</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-org1365bea" class="outline-4">
<h4 id="org1365bea"><span class="section-number-4">4.2.1</span> Exercise 8</h4>
<div class="outline-text-4" id="text-4-2-1">
<blockquote>
<p>
We have omitted a small fragment of code - the code necessary to print octal numbers using patterns of the form "%o". 
Find and fill in this code fragment.
</p>
</blockquote>
<p>
Well, it's easy to complete the code, but it's still alittle hard for me to understand every line here.
</p>

<ul class="org-ul">
<li><code>kern/printf.c</code> rely on <code>lib/printfmt.c</code> and <code>kern/console.c</code> .</li>
<li><code>lib/printfmt.c</code> rely on <code>kern/console.c</code> .</li>
</ul>

<p>
The most important part is here:
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">output a character to the console</span>
<span style="color: #729fcf; font-weight: bold;">static</span> <span style="color: #8ae234; font-weight: bold;">void</span>
<span style="color: #edd400; font-weight: bold;">cons_putc</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">c</span><span style="color: #ffd700;">)</span>
<span style="color: #ffd700;">{</span>
    serial_putc<span style="color: #00bfff;">(</span>c<span style="color: #00bfff;">)</span>;
    lpt_putc<span style="color: #00bfff;">(</span>c<span style="color: #00bfff;">)</span>;
    cga_putc<span style="color: #00bfff;">(</span>c<span style="color: #00bfff;">)</span>;
<span style="color: #ffd700;">}</span>
</pre>
</div>

<p>
Let's firstly finish the code and try to analyse more codes&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #729fcf; font-weight: bold;">case</span> <span style="color: #ad7fa8; font-style: italic;">'o'</span>:
    num = getuint<span style="color: #ffd700;">(</span>&amp;ap, lflag<span style="color: #ffd700;">)</span>;
    base = 8;
    <span style="color: #729fcf; font-weight: bold;">goto</span> <span style="color: #8ae234; font-weight: bold;">number</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb274763" class="outline-4">
<h4 id="orgb274763"><span class="section-number-4">4.2.2</span> Explain the following code from <code>kern/console.c</code> .</h4>
<div class="outline-text-4" id="text-4-2-2">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #729fcf; font-weight: bold;">if</span> <span style="color: #ffd700;">(</span>crt_pos &gt;= CRT_SIZE<span style="color: #ffd700;">)</span> <span style="color: #ffd700;">{</span>
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">i</span>;
    memmove<span style="color: #00bfff;">(</span>crt_buf, crt_buf + CRT_COLS, <span style="color: #ffa500;">(</span>CRT_SIZE - CRT_COLS<span style="color: #ffa500;">)</span> * <span style="color: #729fcf; font-weight: bold;">sizeof</span><span style="color: #ffa500;">(</span>uint16_t<span style="color: #ffa500;">)</span><span style="color: #00bfff;">)</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span> <span style="color: #00bfff;">(</span>i = CRT_SIZE - CRT_COLS; i &lt; CRT_SIZE; i++<span style="color: #00bfff;">)</span>
        crt_buf<span style="color: #00bfff;">[</span>i<span style="color: #00bfff;">]</span> = 0x0700 | <span style="color: #ad7fa8; font-style: italic;">' '</span>;
        crt_pos -= CRT_COLS;
<span style="color: #ffd700;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc1cc327" class="outline-3">
<h3 id="orgc1cc327"><span class="section-number-3">4.3</span> The Stack</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Exploring in more detail the way the C language uses the stack on the x86.
</p>
</div>
