Note/MIT6.828.lab1.org
**** Exercise 9
 #+BEGIN_QUOTE
 Determine where the kernel initializes its stack, and exactly where in memory its stack is located. 
 How does the kernel reserve space for its stack? And at which "end" of this reserved area is the stack pointer initialized to point to?
 #+END_QUOTE

 I noticed codes in =kern/entry.S= :
 #+BEGIN_SRC 
.data
###################################################################
# boot stack
###################################################################
        .p2align        PGSHIFT         # force page alignment
        .globl          bootstack
bootstack:
        .space          KSTKSIZE
	.globl          bootstacktop
bootstacktop:
 #+END_SRC

 and settings here:
 #+BEGIN_SRC 
 # Clear the frame pointer register (EBP)
 # so that once we get into debugging C code,
 # stack backtraces will be terminated properly.
 movl    $0x0,%ebp                       # nuke frame pointer

 # Set the stack pointer
 movl    $(bootstacktop),%esp
 #+END_SRC

 Moreover, in =inc/memlayout.h= :
 #+BEGIN_SRC c
// Kernel stack.
#define KSTACKTOP    KERNBASE
#define KSTKSIZE    (8*PGSIZE)           // size of a kernel stack
#define KSTKGAP        (8*PGSIZE)           // size of a kernel stack guard
 #+END_SRC

 =PGSIZE= is defined in =inc/mmu.h= , which is =4096= .
 Thus =KSTKSIZE = 32KB= .

 Before jump into exercise 10, I want to draw an overview of current memory layout.
 #+BEGIN_SRC 
+------------------+  <- 0xFFFFFFFF (4GB)
|      32-bit      |
|  memory mapped   |
|     devices      |
|                  |
/\/\/\/\/\/\/\/\/\/\

/\/\/\/\/\/\/\/\/\/\
|                  |
|      Unused      |
|                  |
+------------------+  <- depends on amount of RAM
|                  |
|------------------|  <- 0x00110000 (Stack top)
|   Kernel stack   |
|------------------|  <- 0x0010fc00 (end of stack)
|   Kernel codes   |
+------------------+  <- 0x00100000 (1MB)
|     BIOS ROM     |
+------------------+  <- 0x000F0000 (960KB)
|  16-bit devices, |
|  expansion ROMs  |
+------------------+  <- 0x000C0000 (768KB)
|   VGA Display    |
+------------------+  <- 0x000A0000 (640KB)
|                  |
|    Low Memory    |
|                  |
+------------------+  <- 0x00000000
 #+END_SRC

**** Exercise 10
 #+BEGIN_QUOTE
 To become familiar with the C calling conventions on the x86, 
 find the address of the test_backtrace function in obj/kern/kernel.asm, 
 set a breakpoint there, and examine what happens each time it gets called after the kernel starts. 
 How many 32-bit words does each recursive nesting level of test_backtrace push on the stack, and what are those words?

 Note that, for this exercise to work properly, 
 you should be using the patched version of QEMU available on the tools page or on Athena. 
 Otherwise, you'll have to manually translate all breakpoint and memory addresses to linear addresses.
 #+END_QUOTE

 - Function =test_backtrace= in =obj/kern/kernel.asm= :
 #+BEGIN_SRC
f0100040 <test_backtrace>:
 #+END_SRC
 The C codes of =test_backtrace= is in =kern/init.c= :
 #+BEGIN_SRC c
// Test the stack backtrace function (lab 1 only)                               
void
test_backtrace(int x)
{
        cprintf("entering test_backtrace %d\n", x);
        if (x > 0)
                test_backtrace(x-1);
        else
                mon_backtrace(0, 0, 0);
        cprintf("leaving test_backtrace %d\n", x);
}
 #+END_SRC

 Register =%bp= makes stack linked.
 This is a recursion function, let's test this in qemu.
 Firstly, we need to implement more codes...

