Note/MIT6.828.lab1.html

<div id="outline-container-org5742cc4" class="outline-4">
<h4 id="org5742cc4"><span class="section-number-4">4.3.1</span> Exercise 9</h4>
<div class="outline-text-4" id="text-4-3-1">
<blockquote>
<p>
Determine where the kernel initializes its stack, and exactly where in memory its stack is located. 
How does the kernel reserve space for its stack? And at which "end" of this reserved area is the stack pointer initialized to point to?
</p>
</blockquote>

<p>
I noticed codes in <code>kern/entry.S</code> :
</p>
<pre class="example">
.data
###################################################################
# boot stack
###################################################################
        .p2align        PGSHIFT         # force page alignment
        .globl          bootstack
bootstack:
        .space          KSTKSIZE
	.globl          bootstacktop
bootstacktop:
</pre>

<p>
and settings here:
</p>
<pre class="example">
 # Clear the frame pointer register (EBP)
 # so that once we get into debugging C code,
 # stack backtraces will be terminated properly.
 movl    $0x0,%ebp                       # nuke frame pointer

 # Set the stack pointer
 movl    $(bootstacktop),%esp
</pre>

<p>
Moreover, in <code>inc/memlayout.h</code> :
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">Kernel stack.</span>
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347; font-weight: bold;">KSTACKTOP</span>    KERNBASE
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347; font-weight: bold;">KSTKSIZE</span>    <span style="color: #ffd700;">(</span>8*PGSIZE<span style="color: #ffd700;">)</span>           <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">size of a kernel stack</span>
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347; font-weight: bold;">KSTKGAP</span>        <span style="color: #ffd700;">(</span>8*PGSIZE<span style="color: #ffd700;">)</span>           <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">size of a kernel stack guard</span>
</pre>
</div>

<p>
<code>PGSIZE</code> is defined in <code>inc/mmu.h</code> , which is <code>4096</code> .
Thus <code>KSTKSIZE = 32KB</code> .
</p>

<p>
Before jump into exercise 10, I want to draw an overview of current memory layout.
</p>
<pre class="example">
+------------------+  &lt;- 0xFFFFFFFF (4GB)
|      32-bit      |
|  memory mapped   |
|     devices      |
|                  |
/\/\/\/\/\/\/\/\/\/\

/\/\/\/\/\/\/\/\/\/\
|                  |
|      Unused      |
|                  |
+------------------+  &lt;- depends on amount of RAM
|                  |
|------------------|  &lt;- 0x00110000 (Stack top)
|   Kernel stack   |
|------------------|  &lt;- 0x0010fc00 (end of stack)
|   Kernel codes   |
+------------------+  &lt;- 0x00100000 (1MB)
|     BIOS ROM     |
+------------------+  &lt;- 0x000F0000 (960KB)
|  16-bit devices, |
|  expansion ROMs  |
+------------------+  &lt;- 0x000C0000 (768KB)
|   VGA Display    |
+------------------+  &lt;- 0x000A0000 (640KB)
|                  |
|    Low Memory    |
|                  |
+------------------+  &lt;- 0x00000000
</pre>
</div>
</div>

<div id="outline-container-org65d6d34" class="outline-4">
<h4 id="org65d6d34"><span class="section-number-4">4.3.2</span> Exercise 10</h4>
<div class="outline-text-4" id="text-4-3-2">
<blockquote>
<p>
To become familiar with the C calling conventions on the x86, 
find the address of the test<sub>backtrace</sub> function in obj/kern/kernel.asm, 
set a breakpoint there, and examine what happens each time it gets called after the kernel starts. 
How many 32-bit words does each recursive nesting level of test<sub>backtrace</sub> push on the stack, and what are those words?
</p>

<p>
Note that, for this exercise to work properly, 
you should be using the patched version of QEMU available on the tools page or on Athena. 
Otherwise, you'll have to manually translate all breakpoint and memory addresses to linear addresses.
</p>
</blockquote>

<ul class="org-ul">
<li>Function <code>test_backtrace</code> in <code>obj/kern/kernel.asm</code> :</li>
</ul>
<pre class="example">
f0100040 &lt;test_backtrace&gt;:
</pre>
<p>
The C codes of <code>test_backtrace</code> is in <code>kern/init.c</code> :
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">Test the stack backtrace function (lab 1 only)                               </span>
<span style="color: #8ae234; font-weight: bold;">void</span>
<span style="color: #edd400; font-weight: bold;">test_backtrace</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">x</span><span style="color: #ffd700;">)</span>
<span style="color: #ffd700;">{</span>
        cprintf<span style="color: #00bfff;">(</span><span style="color: #ad7fa8; font-style: italic;">"entering test_backtrace %d\n"</span>, x<span style="color: #00bfff;">)</span>;
        <span style="color: #729fcf; font-weight: bold;">if</span> <span style="color: #00bfff;">(</span>x &gt; 0<span style="color: #00bfff;">)</span>
                test_backtrace<span style="color: #00bfff;">(</span>x-1<span style="color: #00bfff;">)</span>;
        <span style="color: #729fcf; font-weight: bold;">else</span>
                mon_backtrace<span style="color: #00bfff;">(</span>0, 0, 0<span style="color: #00bfff;">)</span>;
        cprintf<span style="color: #00bfff;">(</span><span style="color: #ad7fa8; font-style: italic;">"leaving test_backtrace %d\n"</span>, x<span style="color: #00bfff;">)</span>;
<span style="color: #ffd700;">}</span>
</pre>
</div>

<p>
Register <code>%bp</code> makes stack linked.
This is a recursion function, let's test this in qemu.
Firstly, we need to implement more codes&#x2026;
</p>
</div>
</div>
