Note/MIT6.828.lab1.org
**** Exercise 11
#+BEGIN_QUOTE
Implement the backtrace function as specified above. 
Use the same format as in the example, since otherwise the grading script will be confused. 
When you think you have it working right, run make grade to see if its output conforms to what our grading script expects, 
and fix it if it doesn't. 
After you have handed in your Lab 1 code, you are welcome to change the output format of the backtrace function any way you like.

If you use read_ebp(), note that GCC may generate "optimized" code that 
calls read_ebp() before mon_backtrace()'s function prologue, 
which results in an incomplete stack trace (the stack frame of the most recent function call is missing). 
While we have tried to disable optimizations that cause this reordering, 
you may want to examine the assembly of mon_backtrace() and make sure the call to read_ebp() is happening after the function prologue.
#+END_QUOTE
#+BEGIN_SRC c
int
mon_backtrace(int argc, char **argv, struct Trapframe *tf)
{
 	// Your code here.                                                           
	uint32_t ebp, eip, args[5];
        cprintf("Stack backtrace:\n");
        for(ebp = read_ebp(); ebp != 0; ebp = *((uint32_t *)ebp)) {
                eip = *((uint32_t *)ebp + 1);
                args[0] = *((uintptr_t *)ebp + 2);
                args[1] = *((uintptr_t *)ebp + 3);
                args[2] = *((uintptr_t *)ebp + 4);
                args[3] = *((uintptr_t *)ebp + 5);
                args[4] = *((uintptr_t *)ebp + 6);
                cprintf("  ebp %08x  eip %08x  args %08x %08x %08x %08x %08x\n",
                        ebp, eip, args[0], args[1], args[2], args[3], args[4]);
        }
        return 0;
}
#+END_SRC
#+BEGIN_SRC 
entering test_backtrace 5
entering test_backtrace 4
entering test_backtrace 3
entering test_backtrace 2
entering test_backtrace 1
entering test_backtrace 0
Stack backtrace:
  ebp f010ff18  eip f0100078  args 00000000 00000000 00000000 f010004a f0111308
  ebp f010ff38  eip f01000a1  args 00000000 00000001 f010ff78 f010004a f0111308
  ebp f010ff58  eip f01000a1  args 00000001 00000002 f010ff98 f010004a f0111308
  ebp f010ff78  eip f01000a1  args 00000002 00000003 f010ffb8 f010004a f0111308
  ebp f010ff98  eip f01000a1  args 00000003 00000004 00000000 f010004a f0111308
  ebp f010ffb8  eip f01000a1  args 00000004 00000005 00000000 f010004a f0111308
  ebp f010ffd8  eip f01000f4  args 00000005 00001aac 00000640 00000000 00000000
  ebp f010fff8  eip f010003e  args 00000003 00001003 00002003 00003003 00004003
leaving test_backtrace 0
leaving test_backtrace 1
leaving test_backtrace 2
leaving test_backtrace 3
leaving test_backtrace 4
leaving test_backtrace 5
#+END_SRC
Done!

