Note/MIT6.828.lab1.html

<div id="outline-container-org6d6e509" class="outline-4">
<h4 id="org6d6e509"><span class="section-number-4">4.3.3</span> Exercise 11</h4>
<div class="outline-text-4" id="text-4-3-3">
<blockquote>
<p>
Implement the backtrace function as specified above. 
Use the same format as in the example, since otherwise the grading script will be confused. 
When you think you have it working right, run make grade to see if its output conforms to what our grading script expects, 
and fix it if it doesn't. 
After you have handed in your Lab 1 code, you are welcome to change the output format of the backtrace function any way you like.
</p>

<p>
If you use read<sub>ebp</sub>(), note that GCC may generate "optimized" code that 
calls read<sub>ebp</sub>() before mon<sub>backtrace</sub>()'s function prologue, 
which results in an incomplete stack trace (the stack frame of the most recent function call is missing). 
While we have tried to disable optimizations that cause this reordering, 
you may want to examine the assembly of mon<sub>backtrace</sub>() and make sure the call to read<sub>ebp</sub>() is happening after the function prologue.
</p>
</blockquote>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #8ae234; font-weight: bold;">int</span>
<span style="color: #edd400; font-weight: bold;">mon_backtrace</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span> **<span style="color: #ff6347; font-weight: bold;">argv</span>, <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Trapframe</span> *<span style="color: #ff6347; font-weight: bold;">tf</span><span style="color: #ffd700;">)</span>
<span style="color: #ffd700;">{</span>
        <span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">Your code here.                                                           </span>
        <span style="color: #8ae234; font-weight: bold;">uint32_t</span> <span style="color: #ff6347; font-weight: bold;">ebp</span>, <span style="color: #ff6347; font-weight: bold;">eip</span>, <span style="color: #ff6347; font-weight: bold;">args</span><span style="color: #00bfff;">[</span>5<span style="color: #00bfff;">]</span>;
        cprintf<span style="color: #00bfff;">(</span><span style="color: #ad7fa8; font-style: italic;">"Stack backtrace:\n"</span><span style="color: #00bfff;">)</span>;
        <span style="color: #729fcf; font-weight: bold;">for</span><span style="color: #00bfff;">(</span>ebp = read_ebp<span style="color: #ffa500;">()</span>; ebp != 0; ebp = *<span style="color: #ffa500;">(</span><span style="color: #ff7f50;">(</span><span style="color: #8ae234; font-weight: bold;">uint32_t</span> *<span style="color: #ff7f50;">)</span>ebp<span style="color: #ffa500;">)</span><span style="color: #00bfff;">)</span> <span style="color: #00bfff;">{</span>
                eip = *<span style="color: #ffa500;">(</span><span style="color: #ff7f50;">(</span><span style="color: #8ae234; font-weight: bold;">uint32_t</span> *<span style="color: #ff7f50;">)</span>ebp + 1<span style="color: #ffa500;">)</span>;
                args<span style="color: #ffa500;">[</span>0<span style="color: #ffa500;">]</span> = *<span style="color: #ffa500;">(</span><span style="color: #ff7f50;">(</span><span style="color: #8ae234; font-weight: bold;">uintptr_t</span> *<span style="color: #ff7f50;">)</span>ebp + 2<span style="color: #ffa500;">)</span>;
                args<span style="color: #ffa500;">[</span>1<span style="color: #ffa500;">]</span> = *<span style="color: #ffa500;">(</span><span style="color: #ff7f50;">(</span><span style="color: #8ae234; font-weight: bold;">uintptr_t</span> *<span style="color: #ff7f50;">)</span>ebp + 3<span style="color: #ffa500;">)</span>;
                args<span style="color: #ffa500;">[</span>2<span style="color: #ffa500;">]</span> = *<span style="color: #ffa500;">(</span><span style="color: #ff7f50;">(</span><span style="color: #8ae234; font-weight: bold;">uintptr_t</span> *<span style="color: #ff7f50;">)</span>ebp + 4<span style="color: #ffa500;">)</span>;
                args<span style="color: #ffa500;">[</span>3<span style="color: #ffa500;">]</span> = *<span style="color: #ffa500;">(</span><span style="color: #ff7f50;">(</span><span style="color: #8ae234; font-weight: bold;">uintptr_t</span> *<span style="color: #ff7f50;">)</span>ebp + 5<span style="color: #ffa500;">)</span>;
                args<span style="color: #ffa500;">[</span>4<span style="color: #ffa500;">]</span> = *<span style="color: #ffa500;">(</span><span style="color: #ff7f50;">(</span><span style="color: #8ae234; font-weight: bold;">uintptr_t</span> *<span style="color: #ff7f50;">)</span>ebp + 6<span style="color: #ffa500;">)</span>;
                cprintf<span style="color: #ffa500;">(</span><span style="color: #ad7fa8; font-style: italic;">"  ebp %08x  eip %08x  args %08x %08x %08x %08x %08x\n"</span>,
                        ebp, eip, args<span style="color: #ff7f50;">[</span>0<span style="color: #ff7f50;">]</span>, args<span style="color: #ff7f50;">[</span>1<span style="color: #ff7f50;">]</span>, args<span style="color: #ff7f50;">[</span>2<span style="color: #ff7f50;">]</span>, args<span style="color: #ff7f50;">[</span>3<span style="color: #ff7f50;">]</span>, args<span style="color: #ff7f50;">[</span>4<span style="color: #ff7f50;">]</span><span style="color: #ffa500;">)</span>;
        <span style="color: #00bfff;">}</span>
        <span style="color: #729fcf; font-weight: bold;">return</span> 0;
<span style="color: #ffd700;">}</span>
</pre>
</div>
<pre class="example">
entering test_backtrace 5
entering test_backtrace 4
entering test_backtrace 3
entering test_backtrace 2
entering test_backtrace 1
entering test_backtrace 0
Stack backtrace:
  ebp f010ff18  eip f0100078  args 00000000 00000000 00000000 f010004a f0111308
  ebp f010ff38  eip f01000a1  args 00000000 00000001 f010ff78 f010004a f0111308
  ebp f010ff58  eip f01000a1  args 00000001 00000002 f010ff98 f010004a f0111308
  ebp f010ff78  eip f01000a1  args 00000002 00000003 f010ffb8 f010004a f0111308
  ebp f010ff98  eip f01000a1  args 00000003 00000004 00000000 f010004a f0111308
  ebp f010ffb8  eip f01000a1  args 00000004 00000005 00000000 f010004a f0111308
  ebp f010ffd8  eip f01000f4  args 00000005 00001aac 00000640 00000000 00000000
  ebp f010fff8  eip f010003e  args 00000003 00001003 00002003 00003003 00004003
leaving test_backtrace 0
leaving test_backtrace 1
leaving test_backtrace 2
leaving test_backtrace 3
leaving test_backtrace 4
leaving test_backtrace 5
</pre>
<p>
Done!
</p>
</div>
</div>
