Note/MIT6.828.lab1.org
**** Exercise 12
#+BEGIN_QUOTE
Modify your stack backtrace function to display, for each eip, the function name, source file name, and line number corresponding to that eip.

In debuginfo_eip, where do __STAB_* come from? This question has a long answer; to help you to discover the answer, here are some things you might want to do:

look in the file kern/kernel.ld for __STAB_*
run objdump -h obj/kern/kernel
run objdump -G obj/kern/kernel
run gcc -pipe -nostdinc -O2 -fno-builtin -I. -MD -Wall -Wno-format -DJOS_KERNEL -gstabs -c -S kern/init.c, and look at init.s.
see if the bootloader loads the symbol table in memory as part of loading the kernel binary
Complete the implementation of debuginfo_eip by inserting the call to stab_binsearch to find the line number for an address.

Add a backtrace command to the kernel monitor, and extend your implementation of mon_backtrace to call 
debuginfo_eip and print a line for each stack frame of the form:
#+BEGIN_SRC 
K> backtrace
Stack backtrace:
  ebp f010ff78  eip f01008ae  args 00000001 f010ff8c 00000000 f0110580 00000000
         kern/monitor.c:143: monitor+106
  ebp f010ffd8  eip f0100193  args 00000000 00001aac 00000660 00000000 00000000
         kern/init.c:49: i386_init+59
  ebp f010fff8  eip f010003d  args 00000000 00000000 0000ffff 10cf9a00 0000ffff
         kern/entry.S:70: <unknown>+0
K> 
#+END_SRC
Each line gives the file name and line within that file of the stack frame's eip, 
followed by the name of the function and the offset of the eip from the first instruction of the function 
(e.g., monitor+106 means the return eip is 106 bytes past the beginning of monitor).

Be sure to print the file and function names on a separate line, to avoid confusing the grading script.

Tip: printf format strings provide an easy, albeit obscure, way to print non-null-terminated strings like those in STABS tables. 
printf("%.*s", length, string) prints at most length characters of string. Take a look at the printf man page to find out why this works.

You may find that some functions are missing from the backtrace. 
For example, you will probably see a call to monitor() but not to runcmd(). 
This is because the compiler in-lines some function calls. 
Other optimizations may cause you to see unexpected line numbers. 
If you get rid of the -O2 from GNUMakefile, the backtraces may make more sense (but your kernel will run more slowly).
#+END_QUOTE
Let's finish lab 1!

Tracing address is not enough!
We want the function name:)

#+BEGIN_SRC c
int
mon_backtrace(int argc, char **argv, struct Trapframe *tf)
{
        uint32_t ebp, eip, args[5];
        struct Eipdebuginfo info;
        cprintf("Stack backtrace:\n");
	for(ebp = read_ebp(); ebp != 0; ebp = *((uint32_t *)ebp)) {
                eip = *((uint32_t *)ebp + 1);
                debuginfo_eip(eip, &info);
                args[0] = *((uintptr_t *)ebp + 2);
	        args[1] = *((uintptr_t *)ebp + 3);
                args[2] = *((uintptr_t *)ebp + 4);
	        args[3] = *((uintptr_t *)ebp + 5);
	        args[4] = *((uintptr_t *)ebp + 6);
                cprintf("  ebp %08x  eip %08x  args %08x %08x %08x %08x %08x\n",
	                ebp, eip, args[0], args[1], args[2], args[3], args[4]);
                cprintf("      %s:%d: %.*s+%d\n", info.eip_file, info.eip_line,
                        info.eip_fn_namelen, info.eip_fn_name, eip - info.eip_fn_addr);
        }
        return 0;
}
#+END_SRC
plumb into =kern/kdebug.c= :
#+BEGIN_SRC c
// Your code here.                                                                                                                                      
stab_binsearch(stabs, &lline, &rline, N_SLINE, addr);
if(lline <= rline) {
    info->eip_line = stabs[lline].n_desc;
}
else info->eip_line = -1;
#+END_SRC

Have a test:
#+BEGIN_SRC 
Stack backtrace:
  ebp f010ff18  eip f0100078  args 00000000 00000000 00000000 f010004a f0111308
      kern/init.c:18: test_backtrace+56
  ebp f010ff38  eip f01000a1  args 00000000 00000001 f010ff78 f010004a f0111308
      kern/init.c:16: test_backtrace+97
  ebp f010ff58  eip f01000a1  args 00000001 00000002 f010ff98 f010004a f0111308
      kern/init.c:16: test_backtrace+97
  ebp f010ff78  eip f01000a1  args 00000002 00000003 f010ffb8 f010004a f0111308
      kern/init.c:16: test_backtrace+97
  ebp f010ff98  eip f01000a1  args 00000003 00000004 00000000 f010004a f0111308
      kern/init.c:16: test_backtrace+97
  ebp f010ffb8  eip f01000a1  args 00000004 00000005 00000000 f010004a f0111308
      kern/init.c:16: test_backtrace+97
  ebp f010ffd8  eip f01000f4  args 00000005 00001aac 00000640 00000000 00000000
      kern/init.c:39: i386_init+78
  ebp f010fff8  eip f010003e  args 00000003 00001003 00002003 00003003 00004003
      kern/entry.S:83: <unknown>+0
#+END_SRC

The last thing, add command to qemu repl:
#+BEGIN_SRC c
static struct Command commands[] = {
    { "help", "Display this list of commands", mon_help },
    { "kerninfo", "Display information about the kernel", mon_kerninfo },
    { "backtrace", "Display a listing of function call frames", mon_backtrace}
};
#+END_SRC
Done!

