Note/MIT6.828.lab1.html

<div id="outline-container-org7f53a61" class="outline-4">
<h4 id="org7f53a61"><span class="section-number-4">4.3.4</span> Exercise 12</h4>
<div class="outline-text-4" id="text-4-3-4">
<blockquote>
<p>
Modify your stack backtrace function to display, for each eip, the function name, source file name, and line number corresponding to that eip.
</p>

<p>
In debuginfo<sub>eip</sub>, where do _<sub>STAB</sub><sub>*</sub> come from? This question has a long answer; to help you to discover the answer, here are some things you might want to do:
</p>

<p>
look in the file kern/kernel.ld for _<sub>STAB</sub><sub>*</sub>
run objdump -h obj/kern/kernel
run objdump -G obj/kern/kernel
run gcc -pipe -nostdinc -O2 -fno-builtin -I. -MD -Wall -Wno-format -DJOS<sub>KERNEL</sub> -gstabs -c -S kern/init.c, and look at init.s.
see if the bootloader loads the symbol table in memory as part of loading the kernel binary
Complete the implementation of debuginfo<sub>eip</sub> by inserting the call to stab<sub>binsearch</sub> to find the line number for an address.
</p>

<p>
Add a backtrace command to the kernel monitor, and extend your implementation of mon<sub>backtrace</sub> to call 
debuginfo<sub>eip</sub> and print a line for each stack frame of the form:
</p>
<pre class="example">
K&gt; backtrace
Stack backtrace:
  ebp f010ff78  eip f01008ae  args 00000001 f010ff8c 00000000 f0110580 00000000
         kern/monitor.c:143: monitor+106
  ebp f010ffd8  eip f0100193  args 00000000 00001aac 00000660 00000000 00000000
         kern/init.c:49: i386_init+59
  ebp f010fff8  eip f010003d  args 00000000 00000000 0000ffff 10cf9a00 0000ffff
         kern/entry.S:70: &lt;unknown&gt;+0
K&gt; 
</pre>
<p>
Each line gives the file name and line within that file of the stack frame's eip, 
followed by the name of the function and the offset of the eip from the first instruction of the function 
(e.g., monitor+106 means the return eip is 106 bytes past the beginning of monitor).
</p>

<p>
Be sure to print the file and function names on a separate line, to avoid confusing the grading script.
</p>

<p>
Tip: printf format strings provide an easy, albeit obscure, way to print non-null-terminated strings like those in STABS tables. 
printf("%.*s", length, string) prints at most length characters of string. Take a look at the printf man page to find out why this works.
</p>

<p>
You may find that some functions are missing from the backtrace. 
For example, you will probably see a call to monitor() but not to runcmd(). 
This is because the compiler in-lines some function calls. 
Other optimizations may cause you to see unexpected line numbers. 
If you get rid of the -O2 from GNUMakefile, the backtraces may make more sense (but your kernel will run more slowly).
</p>
</blockquote>
<p>
Let's finish lab 1!
</p>

<p>
Tracing address is not enough!
We want the function name:)
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #8ae234; font-weight: bold;">int</span>
<span style="color: #edd400; font-weight: bold;">mon_backtrace</span><span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347; font-weight: bold;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span> **<span style="color: #ff6347; font-weight: bold;">argv</span>, <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Trapframe</span> *<span style="color: #ff6347; font-weight: bold;">tf</span><span style="color: #ffd700;">)</span>
<span style="color: #ffd700;">{</span>
        <span style="color: #8ae234; font-weight: bold;">uint32_t</span> <span style="color: #ff6347; font-weight: bold;">ebp</span>, <span style="color: #ff6347; font-weight: bold;">eip</span>, <span style="color: #ff6347; font-weight: bold;">args</span><span style="color: #00bfff;">[</span>5<span style="color: #00bfff;">]</span>;
        <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Eipdebuginfo</span> <span style="color: #ff6347; font-weight: bold;">info</span>;
        cprintf<span style="color: #00bfff;">(</span><span style="color: #ad7fa8; font-style: italic;">"Stack backtrace:\n"</span><span style="color: #00bfff;">)</span>;
        <span style="color: #729fcf; font-weight: bold;">for</span><span style="color: #00bfff;">(</span>ebp = read_ebp<span style="color: #ffa500;">()</span>; ebp != 0; ebp = *<span style="color: #ffa500;">(</span><span style="color: #ff7f50;">(</span><span style="color: #8ae234; font-weight: bold;">uint32_t</span> *<span style="color: #ff7f50;">)</span>ebp<span style="color: #ffa500;">)</span><span style="color: #00bfff;">)</span> <span style="color: #00bfff;">{</span>
                eip = *<span style="color: #ffa500;">(</span><span style="color: #ff7f50;">(</span><span style="color: #8ae234; font-weight: bold;">uint32_t</span> *<span style="color: #ff7f50;">)</span>ebp + 1<span style="color: #ffa500;">)</span>;
                debuginfo_eip<span style="color: #ffa500;">(</span>eip, &amp;info<span style="color: #ffa500;">)</span>;
                args<span style="color: #ffa500;">[</span>0<span style="color: #ffa500;">]</span> = *<span style="color: #ffa500;">(</span><span style="color: #ff7f50;">(</span><span style="color: #8ae234; font-weight: bold;">uintptr_t</span> *<span style="color: #ff7f50;">)</span>ebp + 2<span style="color: #ffa500;">)</span>;
                args<span style="color: #ffa500;">[</span>1<span style="color: #ffa500;">]</span> = *<span style="color: #ffa500;">(</span><span style="color: #ff7f50;">(</span><span style="color: #8ae234; font-weight: bold;">uintptr_t</span> *<span style="color: #ff7f50;">)</span>ebp + 3<span style="color: #ffa500;">)</span>;
                args<span style="color: #ffa500;">[</span>2<span style="color: #ffa500;">]</span> = *<span style="color: #ffa500;">(</span><span style="color: #ff7f50;">(</span><span style="color: #8ae234; font-weight: bold;">uintptr_t</span> *<span style="color: #ff7f50;">)</span>ebp + 4<span style="color: #ffa500;">)</span>;
                args<span style="color: #ffa500;">[</span>3<span style="color: #ffa500;">]</span> = *<span style="color: #ffa500;">(</span><span style="color: #ff7f50;">(</span><span style="color: #8ae234; font-weight: bold;">uintptr_t</span> *<span style="color: #ff7f50;">)</span>ebp + 5<span style="color: #ffa500;">)</span>;
                args<span style="color: #ffa500;">[</span>4<span style="color: #ffa500;">]</span> = *<span style="color: #ffa500;">(</span><span style="color: #ff7f50;">(</span><span style="color: #8ae234; font-weight: bold;">uintptr_t</span> *<span style="color: #ff7f50;">)</span>ebp + 6<span style="color: #ffa500;">)</span>;
                cprintf<span style="color: #ffa500;">(</span><span style="color: #ad7fa8; font-style: italic;">"  ebp %08x  eip %08x  args %08x %08x %08x %08x %08x\n"</span>,
                        ebp, eip, args<span style="color: #ff7f50;">[</span>0<span style="color: #ff7f50;">]</span>, args<span style="color: #ff7f50;">[</span>1<span style="color: #ff7f50;">]</span>, args<span style="color: #ff7f50;">[</span>2<span style="color: #ff7f50;">]</span>, args<span style="color: #ff7f50;">[</span>3<span style="color: #ff7f50;">]</span>, args<span style="color: #ff7f50;">[</span>4<span style="color: #ff7f50;">]</span><span style="color: #ffa500;">)</span>;
                cprintf<span style="color: #ffa500;">(</span><span style="color: #ad7fa8; font-style: italic;">"      %s:%d: %.*s+%d\n"</span>, info.eip_file, info.eip_line,
                        info.eip_fn_namelen, info.eip_fn_name, eip - info.eip_fn_addr<span style="color: #ffa500;">)</span>;
        <span style="color: #00bfff;">}</span>
        <span style="color: #729fcf; font-weight: bold;">return</span> 0;
<span style="color: #ffd700;">}</span>
</pre>
</div>
<p>
plumb into <code>kern/kdebug.c</code> :
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #888a85; font-style: italic;">// </span><span style="color: #888a85; font-style: italic;">Your code here.                                                                                                                                      </span>
<span style="color: #edd400; font-weight: bold;">stab_binsearch</span><span style="color: #ffd700;">(</span>stabs, &amp;lline, &amp;rline, N_SLINE, addr<span style="color: #ffd700;">)</span>;
<span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #ffd700;">(</span>lline &lt;= rline<span style="color: #ffd700;">)</span> <span style="color: #ffd700;">{</span>
    info-&gt;eip_line = stabs<span style="color: #00bfff;">[</span>lline<span style="color: #00bfff;">]</span>.n_desc;
<span style="color: #ffd700;">}</span>
<span style="color: #729fcf; font-weight: bold;">else</span> info-&gt;eip_line = -1;
</pre>
</div>

<p>
Have a test:
</p>
<pre class="example">
Stack backtrace:
  ebp f010ff18  eip f0100078  args 00000000 00000000 00000000 f010004a f0111308
      kern/init.c:18: test_backtrace+56
  ebp f010ff38  eip f01000a1  args 00000000 00000001 f010ff78 f010004a f0111308
      kern/init.c:16: test_backtrace+97
  ebp f010ff58  eip f01000a1  args 00000001 00000002 f010ff98 f010004a f0111308
      kern/init.c:16: test_backtrace+97
  ebp f010ff78  eip f01000a1  args 00000002 00000003 f010ffb8 f010004a f0111308
      kern/init.c:16: test_backtrace+97
  ebp f010ff98  eip f01000a1  args 00000003 00000004 00000000 f010004a f0111308
      kern/init.c:16: test_backtrace+97
  ebp f010ffb8  eip f01000a1  args 00000004 00000005 00000000 f010004a f0111308
      kern/init.c:16: test_backtrace+97
  ebp f010ffd8  eip f01000f4  args 00000005 00001aac 00000640 00000000 00000000
      kern/init.c:39: i386_init+78
  ebp f010fff8  eip f010003e  args 00000003 00001003 00002003 00003003 00004003
      kern/entry.S:83: &lt;unknown&gt;+0
</pre>

<p>
The last thing, add command to qemu repl:
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #729fcf; font-weight: bold;">static</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Command</span> <span style="color: #ff6347; font-weight: bold;">commands</span><span style="color: #ffd700;">[]</span> = <span style="color: #ffd700;">{</span>
    <span style="color: #00bfff;">{</span> <span style="color: #ad7fa8; font-style: italic;">"help"</span>, <span style="color: #ad7fa8; font-style: italic;">"Display this list of commands"</span>, mon_help <span style="color: #00bfff;">}</span>,
    <span style="color: #00bfff;">{</span> <span style="color: #ad7fa8; font-style: italic;">"kerninfo"</span>, <span style="color: #ad7fa8; font-style: italic;">"Display information about the kernel"</span>, mon_kerninfo <span style="color: #00bfff;">}</span>,
    <span style="color: #00bfff;">{</span> <span style="color: #ad7fa8; font-style: italic;">"backtrace"</span>, <span style="color: #ad7fa8; font-style: italic;">"Display a listing of function call frames"</span>, mon_backtrace<span style="color: #00bfff;">}</span>
<span style="color: #ffd700;">}</span>;
</pre>
</div>
<p>
Done!
</p>
</div>
</div>
</div>
</div>
